zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q19.h
#define PIN_PA20C_SMC_A16                          _L_(20)      /**< SMC signal: A16 on PA20 mux C*/
#define MUX_PA20C_SMC_A16                          _L_(2)       /**< SMC signal line function value: A16 */
#define PIO_PA20C_SMC_A16                          (_UL_(1) << 20)

#define PIN_PA20C_SMC_BA0                          _L_(20)      /**< SMC signal: BA0 on PA20 mux C*/
#define MUX_PA20C_SMC_BA0                          _L_(2)       /**< SMC signal line function value: BA0 */
#define PIO_PA20C_SMC_BA0                          (_UL_(1) << 20)

#define PIN_PA0C_SMC_A17                           _L_(0)       /**< SMC signal: A17 on PA0 mux C*/
#define MUX_PA0C_SMC_A17                           _L_(2)       /**< SMC signal line function value: A17 */
#define PIO_PA0C_SMC_A17                           (_UL_(1) << 0)

#define PIN_PA0C_SMC_BA1                           _L_(0)       /**< SMC signal: BA1 on PA0 mux C*/
#define MUX_PA0C_SMC_BA1                           _L_(2)       /**< SMC signal line function value: BA1 */
#define PIO_PA0C_SMC_BA1                           (_UL_(1) << 0)

#define PIN_PA1C_SMC_A18                           _L_(1)       /**< SMC signal: A18 on PA1 mux C*/
#define MUX_PA1C_SMC_A18                           _L_(2)       /**< SMC signal line function value: A18 */
#define PIO_PA1C_SMC_A18                           (_UL_(1) << 1)

#define PIN_PA23C_SMC_A19                          _L_(23)      /**< SMC signal: A19 on PA23 mux C*/
#define MUX_PA23C_SMC_A19                          _L_(2)       /**< SMC signal line function value: A19 */
#define PIO_PA23C_SMC_A19                          (_UL_(1) << 23)

#define PIN_PA24C_SMC_A20                          _L_(24)      /**< SMC signal: A20 on PA24 mux C*/
#define MUX_PA24C_SMC_A20                          _L_(2)       /**< SMC signal line function value: A20 */
#define PIO_PA24C_SMC_A20                          (_UL_(1) << 24)

#define PIN_PC16A_SMC_A21                          _L_(80)      /**< SMC signal: A21 on PC16 mux A*/
#define MUX_PC16A_SMC_A21                          _L_(0)       /**< SMC signal line function value: A21 */
#define PIO_PC16A_SMC_A21                          (_UL_(1) << 16)

#define PIN_PC16A_SMC_NANDALE                      _L_(80)      /**< SMC signal: NANDALE on PC16 mux A*/
#define MUX_PC16A_SMC_NANDALE                      _L_(0)       /**< SMC signal line function value: NANDALE */
#define PIO_PC16A_SMC_NANDALE                      (_UL_(1) << 16)

#define PIN_PC17A_SMC_A22                          _L_(81)      /**< SMC signal: A22 on PC17 mux A*/
#define MUX_PC17A_SMC_A22                          _L_(0)       /**< SMC signal line function value: A22 */
#define PIO_PC17A_SMC_A22                          (_UL_(1) << 17)

#define PIN_PC17A_SMC_NANDCLE                      _L_(81)      /**< SMC signal: NANDCLE on PC17 mux A*/
#define MUX_PC17A_SMC_NANDCLE                      _L_(0)       /**< SMC signal line function value: NANDCLE */
#define PIO_PC17A_SMC_NANDCLE                      (_UL_(1) << 17)

#define PIN_PA25C_SMC_A23                          _L_(25)      /**< SMC signal: A23 on PA25 mux C*/
#define MUX_PA25C_SMC_A23                          _L_(2)       /**< SMC signal line function value: A23 */
#define PIO_PA25C_SMC_A23                          (_UL_(1) << 25)

#define PIN_PD17C_SMC_CAS                          _L_(113)     /**< SMC signal: CAS on PD17 mux C*/
#define MUX_PD17C_SMC_CAS                          _L_(2)       /**< SMC signal line function value: CAS */
#define PIO_PD17C_SMC_CAS                          (_UL_(1) << 17)

#define PIN_PC0A_SMC_D0                            _L_(64)      /**< SMC signal: D0 on PC0 mux A*/
#define MUX_PC0A_SMC_D0                            _L_(0)       /**< SMC signal line function value: D0 */
#define PIO_PC0A_SMC_D0                            (_UL_(1) << 0)

#define PIN_PC1A_SMC_D1                            _L_(65)      /**< SMC signal: D1 on PC1 mux A*/
#define MUX_PC1A_SMC_D1                            _L_(0)       /**< SMC signal line function value: D1 */
#define PIO_PC1A_SMC_D1                            (_UL_(1) << 1)

#define PIN_PC2A_SMC_D2                            _L_(66)      /**< SMC signal: D2 on PC2 mux A*/
#define MUX_PC2A_SMC_D2                            _L_(0)       /**< SMC signal line function value: D2 */
#define PIO_PC2A_SMC_D2                            (_UL_(1) << 2)

#define PIN_PC3A_SMC_D3                            _L_(67)      /**< SMC signal: D3 on PC3 mux A*/
#define MUX_PC3A_SMC_D3                            _L_(0)       /**< SMC signal line function value: D3 */
#define PIO_PC3A_SMC_D3                            (_UL_(1) << 3)

#define PIN_PC4A_SMC_D4                            _L_(68)      /**< SMC signal: D4 on PC4 mux A*/
#define MUX_PC4A_SMC_D4                            _L_(0)       /**< SMC signal line function value: D4 */
#define PIO_PC4A_SMC_D4                            (_UL_(1) << 4)

#define PIN_PC5A_SMC_D5                            _L_(69)      /**< SMC signal: D5 on PC5 mux A*/
#define MUX_PC5A_SMC_D5                            _L_(0)       /**< SMC signal line function value: D5 */
#define PIO_PC5A_SMC_D5                            (_UL_(1) << 5)

#define PIN_PC6A_SMC_D6                            _L_(70)      /**< SMC signal: D6 on PC6 mux A*/
#define MUX_PC6A_SMC_D6                            _L_(0)       /**< SMC signal line function value: D6 */
#define PIO_PC6A_SMC_D6                            (_UL_(1) << 6)

#define PIN_PC7A_SMC_D7                            _L_(71)      /**< SMC signal: D7 on PC7 mux A*/
#define MUX_PC7A_SMC_D7                            _L_(0)       /**< SMC signal line function value: D7 */
#define PIO_PC7A_SMC_D7                            (_UL_(1) << 7)

#define PIN_PE0A_SMC_D8                            _L_(128)     /**< SMC signal: D8 on PE0 mux A*/
#define MUX_PE0A_SMC_D8                            _L_(0)       /**< SMC signal line function value: D8 */
#define PIO_PE0A_SMC_D8                            (_UL_(1) << 0)

#define PIN_PE1A_SMC_D9                            _L_(129)     /**< SMC signal: D9 on PE1 mux A*/
#define MUX_PE1A_SMC_D9                            _L_(0)       /**< SMC signal line function value: D9 */
#define PIO_PE1A_SMC_D9                            (_UL_(1) << 1)

