zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q19.h
#define PIN_PC31A_EBI_A13                          _L_(95)      /**< EBI signal: A13 on PC31 mux A*/
#define MUX_PC31A_EBI_A13                          _L_(0)       /**< EBI signal line function value: A13 */
#define PIO_PC31A_EBI_A13                          (_UL_(1) << 31)

#define PIN_PA18C_EBI_A14                          _L_(18)      /**< EBI signal: A14 on PA18 mux C*/
#define MUX_PA18C_EBI_A14                          _L_(2)       /**< EBI signal line function value: A14 */
#define PIO_PA18C_EBI_A14                          (_UL_(1) << 18)

#define PIN_PA19C_EBI_A15                          _L_(19)      /**< EBI signal: A15 on PA19 mux C*/
#define MUX_PA19C_EBI_A15                          _L_(2)       /**< EBI signal line function value: A15 */
#define PIO_PA19C_EBI_A15                          (_UL_(1) << 19)

#define PIN_PA20C_EBI_A16                          _L_(20)      /**< EBI signal: A16 on PA20 mux C*/
#define MUX_PA20C_EBI_A16                          _L_(2)       /**< EBI signal line function value: A16 */
#define PIO_PA20C_EBI_A16                          (_UL_(1) << 20)

#define PIN_PA20C_EBI_BA0                          _L_(20)      /**< EBI signal: BA0 on PA20 mux C*/
#define MUX_PA20C_EBI_BA0                          _L_(2)       /**< EBI signal line function value: BA0 */
#define PIO_PA20C_EBI_BA0                          (_UL_(1) << 20)

#define PIN_PA0C_EBI_A17                           _L_(0)       /**< EBI signal: A17 on PA0 mux C*/
#define MUX_PA0C_EBI_A17                           _L_(2)       /**< EBI signal line function value: A17 */
#define PIO_PA0C_EBI_A17                           (_UL_(1) << 0)

#define PIN_PA0C_EBI_BA1                           _L_(0)       /**< EBI signal: BA1 on PA0 mux C*/
#define MUX_PA0C_EBI_BA1                           _L_(2)       /**< EBI signal line function value: BA1 */
#define PIO_PA0C_EBI_BA1                           (_UL_(1) << 0)

#define PIN_PA1C_EBI_A18                           _L_(1)       /**< EBI signal: A18 on PA1 mux C*/
#define MUX_PA1C_EBI_A18                           _L_(2)       /**< EBI signal line function value: A18 */
#define PIO_PA1C_EBI_A18                           (_UL_(1) << 1)

#define PIN_PA23C_EBI_A19                          _L_(23)      /**< EBI signal: A19 on PA23 mux C*/
#define MUX_PA23C_EBI_A19                          _L_(2)       /**< EBI signal line function value: A19 */
#define PIO_PA23C_EBI_A19                          (_UL_(1) << 23)

#define PIN_PA24C_EBI_A20                          _L_(24)      /**< EBI signal: A20 on PA24 mux C*/
#define MUX_PA24C_EBI_A20                          _L_(2)       /**< EBI signal line function value: A20 */
#define PIO_PA24C_EBI_A20                          (_UL_(1) << 24)

#define PIN_PC16A_EBI_A21                          _L_(80)      /**< EBI signal: A21 on PC16 mux A*/
#define MUX_PC16A_EBI_A21                          _L_(0)       /**< EBI signal line function value: A21 */
#define PIO_PC16A_EBI_A21                          (_UL_(1) << 16)

#define PIN_PC16A_EBI_NANDALE                      _L_(80)      /**< EBI signal: NANDALE on PC16 mux A*/
#define MUX_PC16A_EBI_NANDALE                      _L_(0)       /**< EBI signal line function value: NANDALE */
#define PIO_PC16A_EBI_NANDALE                      (_UL_(1) << 16)

#define PIN_PC17A_EBI_A22                          _L_(81)      /**< EBI signal: A22 on PC17 mux A*/
#define MUX_PC17A_EBI_A22                          _L_(0)       /**< EBI signal line function value: A22 */
#define PIO_PC17A_EBI_A22                          (_UL_(1) << 17)

#define PIN_PC17A_EBI_NANDCLE                      _L_(81)      /**< EBI signal: NANDCLE on PC17 mux A*/
#define MUX_PC17A_EBI_NANDCLE                      _L_(0)       /**< EBI signal line function value: NANDCLE */
#define PIO_PC17A_EBI_NANDCLE                      (_UL_(1) << 17)

#define PIN_PA25C_EBI_A23                          _L_(25)      /**< EBI signal: A23 on PA25 mux C*/
#define MUX_PA25C_EBI_A23                          _L_(2)       /**< EBI signal line function value: A23 */
#define PIO_PA25C_EBI_A23                          (_UL_(1) << 25)

#define PIN_PD17C_EBI_CAS                          _L_(113)     /**< EBI signal: CAS on PD17 mux C*/
#define MUX_PD17C_EBI_CAS                          _L_(2)       /**< EBI signal line function value: CAS */
#define PIO_PD17C_EBI_CAS                          (_UL_(1) << 17)

#define PIN_PC0A_EBI_D0                            _L_(64)      /**< EBI signal: D0 on PC0 mux A*/
#define MUX_PC0A_EBI_D0                            _L_(0)       /**< EBI signal line function value: D0 */
#define PIO_PC0A_EBI_D0                            (_UL_(1) << 0)

#define PIN_PC1A_EBI_D1                            _L_(65)      /**< EBI signal: D1 on PC1 mux A*/
#define MUX_PC1A_EBI_D1                            _L_(0)       /**< EBI signal line function value: D1 */
#define PIO_PC1A_EBI_D1                            (_UL_(1) << 1)

#define PIN_PC2A_EBI_D2                            _L_(66)      /**< EBI signal: D2 on PC2 mux A*/
#define MUX_PC2A_EBI_D2                            _L_(0)       /**< EBI signal line function value: D2 */
#define PIO_PC2A_EBI_D2                            (_UL_(1) << 2)

#define PIN_PC3A_EBI_D3                            _L_(67)      /**< EBI signal: D3 on PC3 mux A*/
#define MUX_PC3A_EBI_D3                            _L_(0)       /**< EBI signal line function value: D3 */
#define PIO_PC3A_EBI_D3                            (_UL_(1) << 3)

#define PIN_PC4A_EBI_D4                            _L_(68)      /**< EBI signal: D4 on PC4 mux A*/
#define MUX_PC4A_EBI_D4                            _L_(0)       /**< EBI signal line function value: D4 */
#define PIO_PC4A_EBI_D4                            (_UL_(1) << 4)

#define PIN_PC5A_EBI_D5                            _L_(69)      /**< EBI signal: D5 on PC5 mux A*/
#define MUX_PC5A_EBI_D5                            _L_(0)       /**< EBI signal line function value: D5 */
#define PIO_PC5A_EBI_D5                            (_UL_(1) << 5)

#define PIN_PC6A_EBI_D6                            _L_(70)      /**< EBI signal: D6 on PC6 mux A*/
#define MUX_PC6A_EBI_D6                            _L_(0)       /**< EBI signal line function value: D6 */
#define PIO_PC6A_EBI_D6                            (_UL_(1) << 6)

#define PIN_PC7A_EBI_D7                            _L_(71)      /**< EBI signal: D7 on PC7 mux A*/
#define MUX_PC7A_EBI_D7                            _L_(0)       /**< EBI signal line function value: D7 */
#define PIO_PC7A_EBI_D7                            (_UL_(1) << 7)

#define PIN_PE0A_EBI_D8                            _L_(128)     /**< EBI signal: D8 on PE0 mux A*/
#define MUX_PE0A_EBI_D8                            _L_(0)       /**< EBI signal line function value: D8 */
#define PIO_PE0A_EBI_D8                            (_UL_(1) << 0)

